bit-finance/InformationRegisters/бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоИсключение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловиеПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПравилоЗаполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравилаЗаполненияПолейПриТрансляции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Catalogs/бит_ПравилаЗаполненияПолейПриТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПравилаЗаполненияПолейПриТрансляции</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Comment>Источник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник</Name>
					<Comment>Приемник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПередФормированиемНабораЗаписей</Name>
					<Comment>Код, выполняющийся перед началом формирования набора записей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПередФормированиемЗаписи</Name>
					<Comment>Код, выполняющийся перед началом формирования записи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПослеФормированияЗаписи</Name>
					<Comment>Код, выполняющийся после формирования записи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПослеФормированияНабораЗаписей</Name>
					<Comment>Код, выполняющийся после формирования набора записей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗаполнения</Name>
					<Comment>Код алгоритма заполнения </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать_Соответствие_Статьи_СтатьиРегл</Name>
					<Comment>Использовать соответствие статей оборотов и  статей регл. учета</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать_Соответствие_Статьи_НомГруппы</Name>
					<Comment>Использовать соответствие статей оборотов и номенклатурных групп</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать_Соответствие_ЦФО_Подразделения</Name>
					<Comment>Использовать соответствие ЦФО и подразделений</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать_СинхронизациюПодразделенияЦФО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринудительноеЗаполнениеВалютныхСумм</Name>
					<Comment>Принудительное заполнение валютных сумм</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПроводкиБюджетирования</Name>
					<Comment>Формировать проводки бюджетирования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗависимыеОбороты</Name>
					<Comment>Формировать зависимые обороты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетМПЗпоИсторическойСтоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетАвансовПоИсторическойСтоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИспользованияСоответствий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыИспользованияСоответствийПриТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоляИсточника</Name>
					<Comment>Поля источника</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоляПриемника</Name>
					<Comment>Поля приемника</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Comment>Синоним</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоЗаполнения</Name>
							<Comment>Правило заполнения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Comment>Обязательное</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеСоответствия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСоответствия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыСоответствийАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/InformationRegisters/бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() > 0 Тогда
		НайтиКонкурирующиеЗаписи(Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НайтиКонкурирующиеЗаписи(Отказ)

	ДанныеДляПроверки = Выгрузить();
	Для каждого СтрокаТаблицы Из ДанныеДляПроверки Цикл
		СтрокаТаблицы.ДатаОкончания = ?(ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания), СтрокаТаблицы.ДатаОкончания, '2036-12-31');
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеДляПроверки", ДанныеДляПроверки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсходныеДанные.Период КАК Период,
	|	ИсходныеДанные.ДатаОкончания КАК ДатаОкончания,
	|	ИсходныеДанные.ПравилоЗаполнения КАК ПравилоЗаполнения,
	|	ИсходныеДанные.ОбъектСистемы КАК ОбъектСистемы
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	&ДанныеДляПроверки КАК ИсходныеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляПроверки.Период КАК Период,
	|	ДанныеДляПроверки.ДатаОкончания КАК ДатаОкончания,
	|	ДанныеДляПроверки.ПравилоЗаполнения КАК ПравилоЗаполнения,
	|	ДанныеДляПроверки.ОбъектСистемы КАК ОбъектСистемы,
	|	ПравилаЗаполнения.Источник КАК Источник,
	|	ПравилаЗаполнения.Приемник КАК Приемник
	|ПОМЕСТИТЬ ДанныеДляПроверки
	|ИЗ
	|	ИсходныеДанные КАК ДанныеДляПроверки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ПравилаЗаполненияПолейПриТрансляции КАК ПравилаЗаполнения
	|		ПО ДанныеДляПроверки.ПравилоЗаполнения = ПравилаЗаполнения.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначениеПравил.Период КАК Период,
	|	НазначениеПравил.ПравилоЗаполнения КАК ПравилоЗаполнения,
	|	НазначениеПравил.ОбъектСистемы КАК ОбъектСистемы,
	|	ПравилаЗаполнения.Источник КАК ПравилоЗаполненияИсточник,
	|	ПравилаЗаполнения.Приемник КАК ПравилоЗаполненияПриемник,
	|	НазначениеПравил.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции КАК НазначениеПравил
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ПравилаЗаполненияПолейПриТрансляции КАК ПравилаЗаполнения
	|		ПО НазначениеПравил.ПравилоЗаполнения = ПравилаЗаполнения.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДляПроверки КАК ДанныеДляПроверки
	|		ПО НазначениеПравил.ПравилоЗаполнения <> ДанныеДляПроверки.ПравилоЗаполнения
	|			И НазначениеПравил.ОбъектСистемы = ДанныеДляПроверки.ОбъектСистемы
	|			И (ПравилаЗаполнения.Источник = ДанныеДляПроверки.Источник)
	|			И (ПравилаЗаполнения.Приемник = ДанныеДляПроверки.Приемник)
	|ГДЕ
	|	(НазначениеПравил.Период МЕЖДУ ДанныеДляПроверки.Период И ДанныеДляПроверки.ДатаОкончания
	|			ИЛИ  НазначениеПравил.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ  НазначениеПравил.ДатаОкончания МЕЖДУ ДанныеДляПроверки.Период И ДанныеДляПроверки.ДатаОкончания)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		ПериодДействия = НСтр("ru = 'с %1 по %2'");
		ПериодДействия = СтрШаблон(ПериодДействия, 
							?(ЗначениеЗаполнено(Выборка.Период), Формат(Выборка.Период, "ДЛФ=D"), "..."), 
							?(ЗначениеЗаполнено(Выборка.ДатаОкончания), Формат(Выборка.ДатаОкончания, "ДЛФ=D"), "..."));
							
		ТекстСообщения = НСтр("ru = 'Найдена запись, пересекающаяся по периоду действия с этой записью. Правило: ""%1"", период действия %2 ';
								|en = 'An entry was found that overlaps with this entry in the validity period'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.ПравилоЗаполнения, ПериодДействия); 
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , ,Отказ);
	КонецЦикла;


КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'; en = 'Invalid call of the object on the client.'");
#КонецЕсли
